/*
1. Написать программу, проверяющую что сумма двух (введенных с клавиатуры) чисел
лежит в пределах от 10 до 20 (включительно), если да – вывести строку "true", в
противном случае – "false";
2. Написать программу, выводящую на экран строку “true”, если две целочисленные
константы, объявленные в её начале либо обе равны десяти сами по себе, либо их
сумма равна десяти. Иначе "false".
3. Написать программу которая выводит на экран список всех нечетных чисел он 1 до 50.
Например: "Your numbers: 1 3 5 7 9 11 13 …". Для решения используйте любой С++ цикл.
4. Со звёздочкой. Написать программу, проверяющую, является ли некоторое число -
простым. Простое число — это целое положительное число, которое делится без остатка
только на единицу и себя само.
5. Со звёздочкой. Пользователь вводит с клавиатуры число (год): от 1 до 3000. Написать
программу, которая определяет является ли этот год високосным. Каждый 4-й год
является високосным, кроме каждого 100-го, при этом каждый 400-й – високосный.
Вывести результаты работы программы в консоль.
*/

#include <iostream>

int main()
{
	/* ********************************************************************** */
	// First task
	/* ********************************************************************** */

	double user_a = 0.0;
	double user_b = 0.0;
	double sum_a_b = 0.0;

	std::cout << "Enter number \"a\": ";
	std::cin >> user_a;
	std::cout << "Enter number \"b\": ";
	std::cin >> user_b;
	sum_a_b = user_a + user_b;
	if (sum_a_b >= 10.0 && sum_a_b <= 20.0)
	{
		std::cout << "true";
	}
	else
	{
		std::cout << "false";
	}
	std::cout << "\n_______________________________________________" << std::endl;

	/* ********************************************************************** */
	// Second task
	/* ********************************************************************** */

	int user_c = 0;
	int user_d = 0;
	int sum_c_d = 0;
	
	std::cout << "Enter first int number: ";
	std::cin >> user_c;
	std::cout << "Enter second int number: ";
	std::cin >> user_d;
	sum_c_d = user_c + user_d;
	if (sum_c_d == 10 || (user_c == 10 && user_d == 10))
	{
		std::cout << "true";
	}
	else
	{
		std::cout << "false";
	}

	std::cout << "\n_______________________________________________" << std::endl;

	/* ********************************************************************** */
	// Third task
	/* ********************************************************************** */

	std::cout << "Your numbers: ";
	for (int loc_i = 1; loc_i <= 50; loc_i += 2)
	{
		std::cout << loc_i << " ";
	}

	std::cout << "\n_______________________________________________" << std::endl;

	/* ********************************************************************** */
	// Fourth task
	/* ********************************************************************** */

	unsigned int user_e = 0;
	unsigned int counter = 2;
	bool simple_flag = true;

	std::cout << "Enter unsigned number: ";
	std::cin >> user_e;
	if (user_e > 1)
	{
		if (user_e > 2)
		{
			while (counter < user_e)
			{
				if (user_e % counter++ == 0)
				{
					simple_flag = false;
					break;
				}
				else
				{
					/* NOTHING TO DO */
				}
			}
		}
		else
		{
			/* NOTHING TO DO */
		}
	}
	else
	{
		simple_flag = false;
	}

	if (simple_flag)
	{
		std::cout << "Your number is simple!";
	}
	else
	{
		std::cout << "Your number is not simple!";
	}

	std::cout << "\n_______________________________________________" << std::endl;

	/* ********************************************************************** */
	// Fifth task
	/* ********************************************************************** */

	unsigned user_year = 0;
	bool condition = false;

	std::cout << "Enter a year: ";
	std::cin >> user_year;
	condition = (user_year % 4 == 0 && user_year % 100 != 0) || (user_year % 400 == 0);
	if (condition)
	{
		std::cout << "It's a leap year!";
	}
	else
	{
		std::cout << "It's not a leap year!";
	}

	return 0;
}
